micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_eth_ex.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_eth_ex.h
  * @author  MCD Application Team
  * @brief   Header file of ETH HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_HAL_ETH_EX_H
#define STM32N6xx_HAL_ETH_EX_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined(ETH1)

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal_def.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @addtogroup ETHEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup ETHEx_Exported_Types ETHEx Exported Types
  * @{
  */

/**
  * @brief  ETH RX VLAN structure definition
  */
typedef struct
{
  FunctionalState InnerVLANTagInStatus;      /*!< Enables or disables Inner VLAN Tag in Rx Status  */

  uint32_t StripInnerVLANTag;                /*!< Sets the Inner VLAN Tag Stripping on Receive
                                                  This parameter can be a value of
                                                  @ref ETHEx_Rx_Inner_VLAN_Tag_Stripping */

  FunctionalState InnerVLANTag;              /*!< Enables or disables Inner VLAN Tag */

  FunctionalState DoubleVLANProcessing;      /*!< Enable or Disable double VLAN processing */

  FunctionalState VLANTagHashTableMatch;     /*!< Enable or Disable VLAN Tag Hash Table Match */

  FunctionalState VLANTagInStatus;           /*!< Enable or Disable VLAN Tag in Rx status */

  uint32_t StripVLANTag;                     /*!< Set the VLAN Tag Stripping on Receive
                                                  This parameter can be a value of @ref ETHEx_Rx_VLAN_Tag_Stripping */

  uint32_t VLANTypeCheck;                    /*!< Enable or Disable VLAN Type Check
                                                  This parameter can be a value of @ref ETHEx_VLAN_Type_Check */

  FunctionalState VLANTagInverseMatch;       /*!< Enable or disable VLAN Tag Inverse Match */

  FunctionalState BitVLANcomparison;         /*!< Enable 12-Bit VLAN Tag Comparison */

  uint32_t        VLANcomparison;            /*!< 12-bit or 16-bit VLAN comparison */

  FunctionalState VLANTagEnable;             /*!< VLAN Tag Enable */

  uint32_t        VLANTagID;                 /*!< VLAN Tag ID */

  uint32_t        RxDMAChannelNumber;          /*!< Rx DMA Channel Number  */

  FunctionalState DMAChannelNumberEnable;    /*!< Enable Rx DMA Channel Number */
} ETH_RxVLANConfigTypeDef;
/**
  *
  */

/**
  * @brief  ETH MAC TMRQR INDIRECT REG enum definition
  */
typedef enum
{
  ETH_IND_REG_0    = 0x00000000U,   /*!<  Indirect register 0 */
  ETH_IND_REG_1    = 0x00000001U,   /*!<  Indirect register 1 */
  ETH_IND_REG_2    = 0x00000002U,   /*!<  Indirect register 2 */
  ETH_IND_REG_3    = 0x00000003U,   /*!<  Indirect register 3 */
  ETH_IND_REG_4    = 0x00000004U,   /*!<  Indirect register 4 */
  ETH_IND_REG_5    = 0x00000005U,   /*!<  Indirect register 5 */
  ETH_IND_REG_6    = 0x00000006U,   /*!<  Indirect register 6 */
  ETH_IND_REG_7    = 0x00000007U    /*!<  Indirect register 7 */
} ETH_IDRegTypeDef;
/**
  *
  */
/**
  * @brief  ETH MAC_MTL Mapping Configuration Structure definition
  */
typedef struct
{
  uint32_t                VLANTagFilterFailPacketsQueue;                  /*!< Specifies the Rx queue to which the tagged packets fail DA/SA/VLANtag filter must be routed to */

  FunctionalState         VLANTagFilterFailPacketsQueuingEnable;          /*!< Enables routing the tagged packets fail DA/SA/VLANtag filter to Rx queue */

  uint32_t                MulticastAddFilterFailPacketsQueue;             /*!< Specifies the Rx queue to which the Multicast packets fail the DA/SA filter are routed to */

  FunctionalState         MulticastAddrFilterFailPacketsQueuingEnable;    /*!< Enables routing Multicast Packets fail DA/SA filter to Rx Queue programmed in MFFQ */

  uint32_t                UnicastAddrFilterFailPacketsQueue;              /*!< Specifies the Rx queue to which the Unicast packets fail the DA/SA filter are routed to */

  FunctionalState         UnicastAddrFilterFailPacketsQueuingEnable;      /*!< Enables routing Unicast Packets fail DA/SA filter to Rx Queue programmed in UFFQ */

  FunctionalState         TypeFieldBasedRxQueuingEnable;                  /*!< Enables Type field based Rx queuing */

  uint32_t                OverridingMCBCQueuePrioritySelect;              /*!< Select the Overriding MC-BC queue priority  */

  uint32_t                FramePreemptionResidueQueue;                    /*!< Specifies the Rx queue to which the residual preemption frames must be forwarded */

  uint32_t                TaggedPTPoEPacketsQueuingControl;               /*!< Specifies the routing of the VLAN tagged PTPoE packets */

  FunctionalState         TaggedAVControlPacketsQueuingEnable;            /*!< Enable MAC routes the received Tagged AV control packets to Rx queue specified by AVCPQ field */

  FunctionalState         MulticastBroadcastQueueEnable;                  /*!< Specifies that Multicast or Broadcast packets routing to the Rx queue is enabled */

  uint32_t                MulticastBroadcastQueue;                        /*!< Specifies the Rx queue onto which Multicast or Broadcast packets are routed */

  uint32_t                UntaggedPacketQueue;                            /*!< Specifies the Rx queue to which Untagged Packets are to be routed */

  uint32_t                PTPPacketsQueue;                                /*!< Specifies the Rx queue on which the PTP packets sent over the Ethernet payload */

  uint32_t                AVUntaggedControlPacketsQueue;                  /*!< Specifies the Receive queue to receive AV untagged control packets */

