micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_eth_ex.h
  uint32_t                PrioritiesSelectedRxQ0;                         /*!< Specifies the Priorities Selected in the Receive Queue 0 @ref ETHEx_Rx_VLAN_PRIO */

  uint32_t                PrioritiesSelectedRxQ1;                         /*!< Specifies the Priorities Selected in the Receive Queue 1 @ref ETHEx_Rx_VLAN_PRIO */


} ETH_MACMTLMappingTypeDef;
/**
  *
  */

/**
  * @brief  ETH MTL Queue Configuration Structure definition
  */
typedef struct
{
  uint32_t               QueueOpMode;                     /*!< Queue Disabled, Enabled or AV Mode. */

  uint32_t               AVAlgorithm;                     /*!< Queue Disabled, Enabled or AV Mode. */

  uint32_t               TxQueueSize;                     /*!< Specifies the Tx Queue Size */

  uint32_t               TransmitQueueMode;               /*!< Specifies the Transmit Queue operating mode.*/
} MTL_TxQueueInstance_t;
/**
  *
  */

/**
  * @brief  ETH MTL Queue Configuration Structure definition
  */
typedef struct
{
  uint32_t               QueueOpMode;                     /*!< Queue Disabled, Enabled or AV Mode. */

  uint32_t               RxQueueSize;                     /*!< Specifies the Rx Queue Size */

  FunctionalState        DropTCPIPChecksumErrorPacket;    /*!< Enables or disables Dropping of TCPIP Checksum Error Packets.*/

  FunctionalState        ForwardRxErrorPacket;            /*!< Enables or disables  forwarding Error Packets. */

  FunctionalState        ForwardRxUndersizedGoodPacket;   /*!< Enables or disables  forwarding Undersized Good Packets.*/

  uint32_t               ReceiveQueueMode;                /*!< Specifies the Receive Queue operating mode */

  uint32_t               MappedToDMACh;                   /*!< Specifies the DMA Channel to which MTL Q is mapped */

} MTL_RxQueueInstance_t;
/**
  *
  */

/**
  * @brief  ETH MTL Configuration Structure definition
  */
typedef struct
{
  uint32_t                TxSchedulingAlgorithm;        /*!< Specifies the algorithm for Tx scheduling */

  uint32_t                ReceiveArbitrationAlgorithm;  /*!< Specifies the arbitration algorithm for the Rx side */

  MTL_TxQueueInstance_t   TxQ[ETH_MTL_TX_Q_CNT];        /*!< MTL Tx Queue Configuration */

  MTL_RxQueueInstance_t   RxQ[ETH_MTL_RX_Q_CNT];        /*!< MTL Rx Queue Configuration */

  FunctionalState         TransmitStatus;               /*!< Enables or disables forwarding Tx Packet Status to the application. */

} ETH_MTLConfigTypeDef;
/**
  *
  */

/**
  * @brief  ETH Packet TYPE Queue Configuration structure definition
  */
typedef struct
{
  ETH_IDRegTypeDef Address; /*!< Sets Address Offset for indirect accesses to ETH_MAC_TMRQR */

  uint32_t Type;          /*!< Indicates the type value of packet that needs to be compared with the received packet. */

  uint32_t Queue;         /*!< Indicates the receive queue number to which the packet needs to be forwarded */

  uint32_t Preemption;    /*!< Preemption or Express Packet
                                This parameter can be a value of @ref ETHEx_Preemption_Packet */
} ETH_PacketTypeQueueConfigTypeDef;
/**
  *
  */

/**
  * @brief  ETH TX VLAN structure definition
  */
typedef struct
{
  FunctionalState SourceTxDesc;   /*!< Enable or Disable VLAN tag source from DMA tx descriptors */

  FunctionalState SVLANType;      /*!< Enable or Disable insertion of SVLAN type */

  uint32_t VLANTagControl;        /*!< Sets the VLAN tag control in tx packets
                                      This parameter can be a value of @ref ETHEx_VLAN_Tag_Control */
} ETH_TxVLANConfigTypeDef;
/**
  *
  */

/**
  * @brief  ETH L3 filter structure definition
  */
typedef struct
{
  uint32_t Protocol;                /*!< Sets the L3 filter protocol to IPv4 or IPv6
                                         This parameter can be a value of @ref ETHEx_L3_Protocol */

  uint32_t SrcAddrFilterMatch;      /*!< Sets the L3 filter source address match
                                         This parameter can be a value of @ref ETHEx_L3_Source_Match */

  uint32_t DestAddrFilterMatch;     /*!< Sets the L3 filter destination address match
                                         This parameter can be a value of @ref ETHEx_L3_Destination_Match */

  uint32_t SrcAddrHigherBitsMatch;  /*!< Sets the L3 filter source address higher bits match
                                         This parameter can be a value from 0 to 31 */

  uint32_t DestAddrHigherBitsMatch; /*!< Sets the L3 filter destination address higher bits match
                                         This parameter can be a value from 0 to 31 */

  uint32_t Ip4SrcAddr;              /*!< Sets the L3 filter IPv4 source address if IPv4 protocol is used
                                         This parameter can be a value from 0x0 to 0xFFFFFFFF */

  uint32_t Ip4DestAddr;             /*!< Sets the L3 filter IPv4 destination  address if IPv4 protocol is used
                                         This parameter can be a value from 0 to 0xFFFFFFFF  */

  uint32_t Ip6Addr[4];                 /*!< Sets the L3 filter IPv6 address if IPv6 protocol is used
                                          This parameter must be a table of 4 words (4* 32 bits) */
} ETH_L3FilterConfigTypeDef;
/**
  *
  */

/**
  * @brief  ETH L4 filter structure definition
  */
typedef struct
{
  uint32_t Protocol;               /*!< Sets the L4 filter protocol to TCP or UDP
                                        This parameter can be a value of @ref ETHEx_L4_Protocol */

  uint32_t SrcPortFilterMatch;     /*!< Sets the L4 filter source port match
                                        This parameter can be a value of @ref ETHEx_L4_Source_Match */

  uint32_t DestPortFilterMatch;    /*!< Sets the L4 filter destination port match
                                        This parameter can be a value of @ref ETHEx_L4_Destination_Match */

  uint32_t SourcePort;             /*!< Sets the L4 filter source port
                                        This parameter must be a value from 0x0 to 0xFFFF */

  uint32_t DestinationPort;        /*!< Sets the L4 filter destination port
                                        This parameter must be a value from 0x0 to 0xFFFF */
} ETH_L4FilterConfigTypeDef;
/**
  *
  */

#ifdef HAL_ETH_USE_CBS
/**
  * @brief  ETH CBS Algorithm components
  */
typedef struct
{
  uint32_t               QueueIdx;            /*!< Specifies the queue Index to be configured  */

