micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_eth_ex.h
  uint32_t               SlotCount;           /*!< Specifies number of slots  */

  uint32_t               CreditControl;       /*!< Specifies Credit Control mode  */

  uint32_t               IdleSlope;           /*!< idleSlopeCredit value required for the CBS algorithm */

  uint32_t               SendSlope;           /*!< sendSlope value required for the CBS algorithm */

  uint32_t               HiCredit;            /*!< hiCredit value required for the CBS algorithm */

  uint32_t               LoCredit;            /*!< loCredit value required for the CBS algorithm */

} ETH_CBSConfigTypeDef;
/**
  *
  */

#endif /* HAL_ETH_USE_CBS */

#ifdef HAL_ETH_USE_TAS
/**
  * @brief  ETH TAS Operation components
  */
typedef struct
{
  uint32_t Gate;                         /*! Gate status Open or Closed */

  uint32_t Interval;                     /*! Time interval valid gate control */

} ETH_TASOperationConfigTypeDef;

/**
  * @brief  ETH TAS Operation components
  */
typedef struct
{
  uint64_t         BaseTimeRegister;                         /*! Base Time 32 bits seconds 32 bits nanoseconds */

  uint64_t         CycleTimeRegister;                        /*! Cycle Time 32 bits seconds 32 bits nanoseconds */

  uint32_t         TimeExtensionRegister;                    /*! Time Extension 32 bits seconds 32 bits nanoseconds */

  uint32_t         ListLengthRegister;                       /*! GCL list Length */

  ETH_TASOperationConfigTypeDef *opList;                     /*! Pointer to GCL list size */

} ETH_GCLConfigTypeDef;

/**
  * @brief  ETH Enhancements to Scheduled Traffic components
  */
typedef struct
{
  uint32_t                  SwitchToSWOL;                      /*! Switch to S/W owned list */

  uint32_t                  PTPTimeOffset;                     /*! PTP Time Offset Value */

  uint32_t                  CurrentTimeOffset;                 /*! Current Time Offset Value */

  uint32_t                  TimeIntervalLeftShift;             /*! Time Interval Left Shift Amount */

  uint32_t                  LoopCountSchedulingError;          /*! Loop Count to report Scheduling Error */

  FunctionalState           DropFramesCausingError;            /*! Drop Frames causing Scheduling Error */

  FunctionalState           NotDropFramesDuringFrameSizeError; /*! Drop Frames causing Scheduling Error */

  uint32_t                  OverheadBytesValue;                /*! Overhead Bytes Value */

  ETH_GCLConfigTypeDef      GCLRegisters;                     /*! Pointer to GCL Registers */

} ETH_ESTConfigTypeDef;
/**
  *
  */
#endif /* HAL_ETH_USE_TAS */

#ifdef HAL_ETH_USE_FPE
/**
  * @brief  ETH Frame Preemption components
  */
typedef struct
{
  uint32_t            AdditionalFragmentSize;   /*! Additional Fragment Size */

  uint32_t            PreemptionClassification; /*! Preemption Classification
                                      This parameter can be a combination of @ref ETHEx_FPE_Preemption_Classification*/

  uint32_t            HoldReleaseStatus;        /*! Hold/Release Status */

  FunctionalState     SendVerifymPacket;        /*! Send Verify mPacket */

  FunctionalState     SendRespondmPacket;       /*! Send Respond mPacket */

  uint32_t            HoldAdvance;              /*! The maximum time in nanoseconds that can elapse between issuing a
                                               HOLD to the MAC and the MAC ceasing to transmit any preemptible frame */
  uint32_t            ReleaseAdvance;           /*! The maximum time in nanoseconds that can elapse between issuing a
                             RELEASE to the MAC and the MAC being ready to resume transmission of preemptible frames */
} ETH_FPEConfigTypeDef;
/**
  *
  */
#endif /* HAL_ETH_USE_FPE */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup ETHEx_Exported_Constants ETHEx Exported Constants
  * @{
  */

/** @defgroup ETHEx_LPI_Event ETHEx LPI Event
  * @{
  */
#define ETH_TX_LPI_ENTRY    ETH_MACLCSR_TLPIEN
#define ETH_TX_LPI_EXIT     ETH_MACLCSR_TLPIEX
#define ETH_RX_LPI_ENTRY    ETH_MACLCSR_RLPIEN
#define ETH_RX_LPI_EXIT     ETH_MACLCSR_RLPIEX
/**
  * @}
  */

/** @defgroup ETHEx_L3_Filter ETHEx L3 Filter
  * @{
  */
#define ETH_L3_FILTER_0                 0x00000000U
#define ETH_L3_FILTER_1                 0x0000000CU
/**
  * @}
  */

/** @defgroup ETHEx_L4_Filter ETHEx L4 Filter
  * @{
  */
#define ETH_L4_FILTER_0                 0x00000000U
#define ETH_L4_FILTER_1                 0x0000000CU
/**
  * @}
  */

/** @defgroup ETHEx_L3_Protocol ETHEx L3 Protocol
  * @{
  */
#define ETH_L3_IPV6_MATCH                       ETH_MACL3L4C0R_L3PEN0
#define ETH_L3_IPV4_MATCH                       0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_L3_Source_Match ETHEx L3 Source Match
  * @{
  */
#define ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE    ETH_MACL3L4C0R_L3SAM0
#define ETH_L3_SRC_ADDR_INVERSE_MATCH_ENABLE    (ETH_MACL3L4C0R_L3SAM0 | ETH_MACL3L4C0R_L3SAIM0)
#define ETH_L3_SRC_ADDR_MATCH_DISABLE           0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_L3_Destination_Match ETHEx L3 Destination Match
  * @{
  */
#define ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE   ETH_MACL3L4C0R_L3DAM0
#define ETH_L3_DEST_ADDR_INVERSE_MATCH_ENABLE   (ETH_MACL3L4C0R_L3DAM0 | ETH_MACL3L4C0R_L3DAIM0)
#define ETH_L3_DEST_ADDR_MATCH_DISABLE          0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_L4_Protocol ETHEx L4 Protocol
  * @{
  */
#define ETH_L4_UDP_MATCH                        ETH_MACL3L4C0R_L4PEN0
#define ETH_L4_TCP_MATCH                        0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_L4_Source_Match ETHEx L4 Source Match
  * @{
  */
#define ETH_L4_SRC_PORT_PERFECT_MATCH_ENABLE    ETH_MACL3L4C0R_L4SPM0
#define ETH_L4_SRC_PORT_INVERSE_MATCH_ENABLE    (ETH_MACL3L4C0R_L4SPM0 |ETH_MACL3L4C0R_L4SPIM0)
#define ETH_L4_SRC_PORT_MATCH_DISABLE           0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_L4_Destination_Match ETHEx L4 Destination Match
  * @{
  */
#define ETH_L4_DEST_PORT_PERFECT_MATCH_ENABLE   ETH_MACL3L4C0R_L4DPM0
#define ETH_L4_DEST_PORT_INVERSE_MATCH_ENABLE   (ETH_MACL3L4C0R_L4DPM0 | ETH_MACL3L4C0R_L4DPIM0)
#define ETH_L4_DEST_PORT_MATCH_DISABLE          0x00000000U
/**
  * @}
  */

