micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_eth_ex.h
/** @defgroup ETHEx_Rx_Inner_VLAN_Tag_Stripping ETHEx Rx Inner VLAN Tag Stripping
  * @{
  */
#define ETH_INNERVLANTAGRXSTRIPPING_NONE      ETH_MACVTCR_EIVLS_DONOTSTRIP
#define ETH_INNERVLANTAGRXSTRIPPING_IFPASS    ETH_MACVTCR_EIVLS_STRIPIFPASS
#define ETH_INNERVLANTAGRXSTRIPPING_IFFAILS   ETH_MACVTCR_EIVLS_STRIPIFFAILS
#define ETH_INNERVLANTAGRXSTRIPPING_ALWAYS    ETH_MACVTCR_EIVLS_ALWAYSSTRIP
/**
  * @}
  */

/** @defgroup ETHEx_Rx_VLAN_Tag_Stripping ETHEx Rx VLAN Tag Stripping
  * @{
  */
#define ETH_VLANTAGRXSTRIPPING_NONE      ETH_MACVTCR_EVLS_DONOTSTRIP
#define ETH_VLANTAGRXSTRIPPING_IFPASS    ETH_MACVTCR_EVLS_STRIPIFPASS
#define ETH_VLANTAGRXSTRIPPING_IFFAILS   ETH_MACVTCR_EVLS_STRIPIFFAILS
#define ETH_VLANTAGRXSTRIPPING_ALWAYS    ETH_MACVTCR_EVLS_ALWAYSSTRIP
/**
  * @}
  */

/** @defgroup ETHEx_VLAN_Type_Check ETHEx VLAN Type Check
  * @{
  */
#define ETH_VLANTYPECHECK_DISABLE    ETH_MACVTCR_DOVLTC
#define ETH_VLANTYPECHECK_SVLAN      (ETH_MACVTCR_ERSVLM | ETH_MACVTCR_ESVL)
#define ETH_VLANTYPECHECK_CVLAN      0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_VLAN_Tag_Control ETHEx_VLAN_Tag_Control
  * @{
  */
#define ETH_VLANTAGCONTROL_NONE       (ETH_MACVIR_VLP | ETH_MACVIR_VLC_NOVLANTAG)
#define ETH_VLANTAGCONTROL_DELETE     (ETH_MACVIR_VLP | ETH_MACVIR_VLC_VLANTAGDELETE)
#define ETH_VLANTAGCONTROL_INSERT     (ETH_MACVIR_VLP | ETH_MACVIR_VLC_VLANTAGINSERT)
#define ETH_VLANTAGCONTROL_REPLACE    (ETH_MACVIR_VLP | ETH_MACVIR_VLC_VLANTAGREPLACE)
/**
  * @}
  */

/** @defgroup ETHEx_Tx_VLAN_Tag ETHEx Tx VLAN Tag
  * @{
  */
#define ETH_INNER_TX_VLANTAG    0x00000001U
#define ETH_OUTER_TX_VLANTAG    0x00000000U
/**
  * @}
  */

/** @defgroup ETHEx_Rx_VLAN_PRIO ETHEx Rx VLAN PRIO
  * @{
  */
#define  ETH_RX_QUEUE_PRIO_0   0x00000001U    /*!<  Rx VLAN User Tag Priority 0 */
#define  ETH_RX_QUEUE_PRIO_1   0x00000002U    /*!<  Rx VLAN User Tag Priority 1 */
#define  ETH_RX_QUEUE_PRIO_2   0x00000004U    /*!<  Rx VLAN User Tag Priority 2 */
#define  ETH_RX_QUEUE_PRIO_3   0x00000008U    /*!<  Rx VLAN User Tag Priority 3 */
#define  ETH_RX_QUEUE_PRIO_4   0x00000010U    /*!<  Rx VLAN User Tag Priority 4 */
#define  ETH_RX_QUEUE_PRIO_5   0x00000020U    /*!<  Rx VLAN User Tag Priority 5 */
#define  ETH_RX_QUEUE_PRIO_6   0x00000040U    /*!<  Rx VLAN User Tag Priority 6 */
#define  ETH_RX_QUEUE_PRIO_7   0x00000080U    /*!<  Rx VLAN User Tag Priority 7 */
/**
  * @}
  */

/** @defgroup ETHEx_Preemption_Packet ETHEx Preemption Packet
  * @{
  */
#define ETH_EXPRESS_PACKET           0x00000000U
#define ETH_PREEMPTION_PACKET        ETH_MACTMRQR_PFEX
/**
  * @}
  */

/** @defgroup ETHEx_Command_Type ETHEx Command Type
  * @{
  */
#define ETH_WRITE_OPERATION          0x00000000U
#define ETH_READ_OPERATION           ETH_MACIACR_COM
/**
  * @}
  */

#ifdef HAL_ETH_USE_CBS
/** @defgroup ETHEx_CBS_Credit_Control ETHEx CBS Credit Control
  * @{
  */
#define ETH_ENABLE_CBS_CREDIT_CONTROL    ETH_MTLTXQ1ECR_CC
#define ETH_DISABLE_CBS_CREDIT_CONTROL   0x00000000U
/**
  * @}
  */
#endif /* HAL_ETH_USE_CBS */

#ifdef HAL_ETH_USE_TAS
#ifndef ETH_HWRESET_TIMEOUT
#define ETH_HWRESET_TIMEOUT     1000U
#endif /* ETH_SWRESET_TIMEOUT */
#endif /* HAL_ETH_USE_TAS */

#ifdef HAL_ETH_USE_FPE
/** @defgroup ETHEx_FPE_Preemption_Classification ETHEx FPE Preemption Classification
  * @{
  */
#define ETH_QUEUE0_EXPRESS         0x00000000U
#define ETH_QUEUE0_PREEMPTABLE     0x00000100U
#define ETH_QUEUE1_EXPRESS         0x00000000U
#define ETH_QUEUE1_PREEMPTABLE     0x00000200U
/**
  * @}
  */
#endif /* HAL_ETH_USE_FPE */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ETHEx_Exported_Functions
  * @{
  */

/** @addtogroup ETHEx_Exported_Functions_Group1
  * @{
  */
/* MAC ARP Offloading APIs  ***************************************************/
void              HAL_ETHEx_EnableARPOffload(ETH_HandleTypeDef *heth);
void              HAL_ETHEx_DisableARPOffload(ETH_HandleTypeDef *heth);
void              HAL_ETHEx_SetARPAddressMatch(ETH_HandleTypeDef *heth, uint32_t IpAddress);

/* MAC L3 L4 Filtering APIs ***************************************************/
void              HAL_ETHEx_EnableL3L4Filtering(ETH_HandleTypeDef *heth);
void              HAL_ETHEx_DisableL3L4Filtering(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_GetL3FilterConfig(const ETH_HandleTypeDef *heth, uint32_t Filter,
                                              ETH_L3FilterConfigTypeDef *pL3FilterConfig);
HAL_StatusTypeDef HAL_ETHEx_GetL4FilterConfig(const ETH_HandleTypeDef *heth, uint32_t Filter,
                                              ETH_L4FilterConfigTypeDef *pL4FilterConfig);
HAL_StatusTypeDef HAL_ETHEx_SetL3FilterConfig(ETH_HandleTypeDef *heth, uint32_t Filter,
                                              const ETH_L3FilterConfigTypeDef *pL3FilterConfig);
HAL_StatusTypeDef HAL_ETHEx_SetL4FilterConfig(ETH_HandleTypeDef *heth, uint32_t Filter,
                                              const ETH_L4FilterConfigTypeDef *pL4FilterConfig);

/* MAC VLAN Processing APIs    ************************************************/
void              HAL_ETHEx_EnableVLANProcessing(ETH_HandleTypeDef *heth);
void              HAL_ETHEx_DisableVLANProcessing(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_GetRxVLANConfig(const ETH_HandleTypeDef *heth, ETH_RxVLANConfigTypeDef *pVlanConfig);
HAL_StatusTypeDef HAL_ETHEx_SetRxVLANConfig(ETH_HandleTypeDef *heth, ETH_RxVLANConfigTypeDef *pVlanConfig);
void              HAL_ETHEx_SetVLANHashTable(ETH_HandleTypeDef *heth, uint32_t VLANHashTable);
HAL_StatusTypeDef HAL_ETHEx_GetTxVLANConfig(const ETH_HandleTypeDef *heth, uint32_t VLANTag,
                                            ETH_TxVLANConfigTypeDef *pVlanConfig);
HAL_StatusTypeDef HAL_ETHEx_SetTxVLANConfig(ETH_HandleTypeDef *heth, uint32_t VLANTag,
                                            const ETH_TxVLANConfigTypeDef *pVlanConfig);
void              HAL_ETHEx_SetTxVLANIdentifier(ETH_HandleTypeDef *heth, uint32_t VLANTag, uint32_t VLANIdentifier);

/* Energy Efficient Ethernet APIs *********************************************/
void              HAL_ETHEx_EnterLPIMode(ETH_HandleTypeDef *heth, FunctionalState TxAutomate,
                                         FunctionalState TxClockStop);
void              HAL_ETHEx_ExitLPIMode(ETH_HandleTypeDef *heth);
uint32_t          HAL_ETHEx_GetMACLPIEvent(const ETH_HandleTypeDef *heth);
/* Multi-Queue Ethernet APIs *********************************************/
uint32_t          HAL_ETHEx_GetRxDMAChNumber(const ETH_HandleTypeDef *heth);
uint32_t          HAL_ETHEx_GetTxDMAChNumber(const ETH_HandleTypeDef *heth);
uint32_t          HAL_ETHEx_GetRxMTLQNumber(const ETH_HandleTypeDef *heth);
uint32_t          HAL_ETHEx_GetTxMTLQNumber(const ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_GetMTLConfig(const ETH_HandleTypeDef *heth, ETH_MTLConfigTypeDef *mtlconf);
HAL_StatusTypeDef HAL_ETHEx_SetMTLConfig(ETH_HandleTypeDef *heth, ETH_MTLConfigTypeDef *mtlconf);
HAL_StatusTypeDef HAL_ETHEx_SetMACMTLMappingConfig(ETH_HandleTypeDef *heth, const ETH_MACMTLMappingTypeDef *macmtlconf);
HAL_StatusTypeDef HAL_ETHEx_GetMACMTLMappingConfig(const ETH_HandleTypeDef *heth, ETH_MACMTLMappingTypeDef *macmtlconf);
void              ETHEx_SetMTLConfig(ETH_HandleTypeDef *heth, const ETH_MTLConfigTypeDef *mtlconf);
HAL_StatusTypeDef ETHEx_SetMACMTLMappingConfig(ETH_HandleTypeDef *heth, const ETH_MACMTLMappingTypeDef *macmtlconf);
HAL_StatusTypeDef HAL_ETHEx_SetUserTagPriorityQueue(ETH_HandleTypeDef *heth, uint32_t psrq, uint32_t queue);
HAL_StatusTypeDef HAL_ETHEx_GetUserTagPriorityQueue(const ETH_HandleTypeDef *heth, uint32_t *psrq,
                                                    uint32_t queue);
HAL_StatusTypeDef HAL_ETHEx_SetPacketTypeQueue(ETH_HandleTypeDef *heth,
                                               const ETH_PacketTypeQueueConfigTypeDef *typequeueconf);
HAL_StatusTypeDef HAL_ETHEx_GetPacketTypeQueue(ETH_HandleTypeDef *heth,
                                               ETH_PacketTypeQueueConfigTypeDef *typequeueconf);
#ifdef HAL_ETH_USE_CBS
HAL_StatusTypeDef HAL_ETHEx_SetCBSConfig(ETH_HandleTypeDef *heth, ETH_CBSConfigTypeDef *cbsconf);
HAL_StatusTypeDef HAL_ETHEx_GetCBSConfig(const ETH_HandleTypeDef *heth,
                                         ETH_CBSConfigTypeDef *pCBSConfig, uint8_t queueIndex);
HAL_StatusTypeDef HAL_ETHEx_EnableCBS(ETH_HandleTypeDef *heth, uint8_t queueIndex);
#endif /* HAL_ETH_USE_CBS */
#ifdef HAL_ETH_USE_TAS
uint32_t          HAL_ETHEx_GetGCLDepth(const ETH_HandleTypeDef *heth);
uint32_t          HAL_ETHEx_GetGCLWidthTimeInterval(const ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_EnableEST(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_DisableEST(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_SetESTConfig(ETH_HandleTypeDef *heth,  ETH_ESTConfigTypeDef *estconf);
HAL_StatusTypeDef HAL_ETHEx_SetGCLRegisters(ETH_HandleTypeDef *heth, const ETH_GCLConfigTypeDef *gclconf);
HAL_StatusTypeDef HAL_ETHEx_SetGCLConfig(ETH_HandleTypeDef *heth, ETH_GCLConfigTypeDef *gclconf);
HAL_StatusTypeDef HAL_ETHEx_GetGCLRegisters(ETH_HandleTypeDef *heth, ETH_GCLConfigTypeDef *gclconf);
#endif /* HAL_ETH_USE_TAS */
#ifdef HAL_ETH_USE_FPE
HAL_StatusTypeDef HAL_ETHEx_EnableFPE(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_DisableFPE(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETHEx_GetFPEConfig(ETH_HandleTypeDef *heth,  ETH_FPEConfigTypeDef *fpeconf);
HAL_StatusTypeDef HAL_ETHEx_SetFPEConfig(ETH_HandleTypeDef *heth,  ETH_FPEConfigTypeDef *fpeconf);
#endif /* HAL_ETH_USE_FPE */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* ETH1 */

#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_HAL_ETH_EX_H */
